terranblake/Esp32_oscilloscope/servers/oscilloscope.h
      // --- NEW PARSING LOGIC using ArduinoJson ---
      String commandString = String((char *) s);
      bool parseOk = false;
      bool anyAnalogActive = false;
      bool anyDigitalActive = false;
      adc_oneshot_unit_handle_t adc1_handle = NULL; // << Initialize ADC handle here

      // Allocate JsonDocument. Adjust size as needed.
      JsonDocument doc;
      DeserializationError error = deserializeJson(doc, commandString);

      if (error) {
          char errorMsg[100];
          snprintf(errorMsg, sizeof(errorMsg), "[oscilloscope] JSON deserializeJson() failed: %s", error.c_str());
          __oscilloscope_h_debug__(errorMsg);
          webSocket->sendString(errorMsg);
          return;
      }

      // --- Extract global settings ---
      if (!doc.containsKey("timebase")) {
          __oscilloscope_h_debug__("[oscilloscope] JSON missing 'timebase'.");
          webSocket->sendString("[oscilloscope] JSON missing 'timebase'.");
          return;
      }
      sharedMemory.samplingTime = doc["timebase"] | 1000;
      strcpy(sharedMemory.samplingTimeUnit, "us"); // Assume microseconds

      // Calculate screenWidthTime
      sharedMemory.screenWidthTime = (unsigned long)sharedMemory.samplingTime * (MAX_OSC_SAMPLES_PER_PACKET - 1);
      strcpy(sharedMemory.screenWidthTimeUnit, "us");

      __oscilloscope_h_debug__(("Parsed timebase: " + String(sharedMemory.samplingTime) + " us").c_str());
      __oscilloscope_h_debug__(("Calculated screenWidthTime: " + String(sharedMemory.screenWidthTime) + " us").c_str());

      // --- Extract channel configurations ---
      if (!doc.containsKey("channels") || !doc["channels"].is<JsonArray>()) {
          __oscilloscope_h_debug__("[oscilloscope] JSON missing or invalid 'channels' array.");
          webSocket->sendString("[oscilloscope] JSON missing or invalid 'channels' array.");
          return;
      }
      JsonArray channels = doc["channels"].as<JsonArray>();

      // --- Define gpio_to_adc1_channel helper function (ensure it's before runOscilloscope) ---
      // NOTE: This function needs to be moved *outside* runOscilloscope, maybe near the top of the file.
      // Placing it here temporarily for the edit tool.
      static esp_err_t gpio_to_adc1_channel(gpio_num_t gpio, adc1_channel_t *channel) {
          switch (gpio) {
              #if CONFIG_IDF_TARGET_ESP32
                  case 36: *channel = ADC1_CHANNEL_0; return ESP_OK;
                  case 37: *channel = ADC1_CHANNEL_1; return ESP_OK;
                  case 38: *channel = ADC1_CHANNEL_2; return ESP_OK;
                  case 39: *channel = ADC1_CHANNEL_3; return ESP_OK;
                  case 32: *channel = ADC1_CHANNEL_4; return ESP_OK;
                  case 33: *channel = ADC1_CHANNEL_5; return ESP_OK;
                  case 34: *channel = ADC1_CHANNEL_6; return ESP_OK;
                  case 35: *channel = ADC1_CHANNEL_7; return ESP_OK;
              #elif CONFIG_IDF_TARGET_ESP32S2 || CONFIG_IDF_TARGET_ESP32S3
                  case  1: *channel = ADC1_CHANNEL_0; return ESP_OK;
                  case  2: *channel = ADC1_CHANNEL_1; return ESP_OK;
                  case  3: *channel = ADC1_CHANNEL_2; return ESP_OK;
                  case  4: *channel = ADC1_CHANNEL_3; return ESP_OK;
                  case  5: *channel = ADC1_CHANNEL_4; return ESP_OK;
                  case  6: *channel = ADC1_CHANNEL_5; return ESP_OK;
                  case  7: *channel = ADC1_CHANNEL_6; return ESP_OK;
                  case  8: *channel = ADC1_CHANNEL_7; return ESP_OK;
                  case  9: *channel = ADC1_CHANNEL_8; return ESP_OK;
                  case 10: *channel = ADC1_CHANNEL_9; return ESP_OK;
              #elif CONFIG_IDF_TARGET_ESP32C3
                   case  0: *channel = ADC1_CHANNEL_0; return ESP_OK;
                   case  1: *channel = ADC1_CHANNEL_1; return ESP_OK;
                   case  2: *channel = ADC1_CHANNEL_2; return ESP_OK;
                   case  3: *channel = ADC1_CHANNEL_3; return ESP_OK;
                   case  4: *channel = ADC1_CHANNEL_4; return ESP_OK;
              #else
                  // Add other supported targets if necessary
              #endif
              default: return ESP_ERR_INVALID_ARG; // GPIO not valid for ADC1
          }
      }
      // --- End of helper function definition ---


      sharedMemory.numActiveChannels = 0;
      for (JsonVariant channel : channels) {
          JsonObject chObj = channel.as<JsonObject>();
          int chIndex = chObj["ch"] | -1;

          if (chIndex < 0 || chIndex >= MAX_OSC_CHANNELS) {
              __oscilloscope_h_debug__(("[oscilloscope] Invalid channel index: " + String(chIndex)).c_str());
              continue;
          }

          OscChannelConfig *cfg = &sharedMemory.channelConfig[chIndex];

          cfg->is_active = chObj["active"] | false;
          if (!cfg->is_active) {
              cfg->adc_channel = ADC1_CHANNEL_MAX; // Mark as invalid if inactive
              cfg->adc_handle = NULL;
              continue;
          }

          sharedMemory.numActiveChannels++;

          cfg->is_analog = chObj["analog"] | false;
          cfg->gpio = (gpio_num_t)(chObj["gpio"] | -1);
          cfg->sensitivity = chObj["sens"] | 0;
          cfg->position = chObj["pos"] | 0;
          cfg->posTriggerEnabled = chObj["trig_pos_en"] | false;
          cfg->posTriggerTreshold = chObj["trig_pos_val"] | 0;
          cfg->negTriggerEnabled = chObj["trig_neg_en"] | false;
          cfg->negTriggerTreshold = chObj["trig_neg_val"] | 0;
          cfg->adc_handle = NULL; // Initialize handle

          if (cfg->gpio < 0 || cfg->gpio >= GPIO_NUM_MAX) {
               char errorMsg[100];
               snprintf(errorMsg, sizeof(errorMsg), "[oscilloscope] Invalid GPIO %d for channel %d.", (int)cfg->gpio, chIndex);
               __oscilloscope_h_debug__(errorMsg);
               webSocket->sendString(errorMsg);
               return;
          }

          if (cfg->is_analog) {
              anyAnalogActive = true;
              esp_err_t ret = gpio_to_adc1_channel(cfg->gpio, &cfg->adc_channel);
              if (ret != ESP_OK) {
                   char errorMsg[100];
                   snprintf(errorMsg, sizeof(errorMsg), "[oscilloscope] GPIO %d cannot be used for ADC1 on channel %d.", (int)cfg->gpio, chIndex);
                   __oscilloscope_h_debug__(errorMsg);
                   webSocket->sendString(errorMsg);
                   return;
              }
              __oscilloscope_h_debug__(("Channel " + String(chIndex) + " (Analog): GPIO=" + String(cfg->gpio) + " ADC1_CH=" + String(cfg->adc_channel)).c_str());

          } else {
              anyDigitalActive = true;
              cfg->adc_channel = ADC1_CHANNEL_MAX; // Mark as invalid ADC channel
              __oscilloscope_h_debug__(("Channel " + String(chIndex) + " (Digital): GPIO=" + String(cfg->gpio)).c_str());
          }
      }

