terranblake/Esp32_oscilloscope/servers/oscilloscope.h
      // Hardware setup, task selection, start & cleanup will be added in subsequent edits. // <<< Update comment
      // Task selection, start & cleanup will be added in subsequent edits.
      parseOk = true; // Mark parsing as successful for now
      // --- END NEW PARSING LOGIC ---

      // --- OLD PARSING LOGIC --- REMOVE/COMMENT START ---
      /*
      // try to parse what we have got from client
      char posNeg1 [9] = "";
      char posNeg2 [9] = "";
      int treshold1;
      int treshold2;
      char *cmdPart1 = (char *) s;
      char *cmdPart2 = strstr (cmdPart1, " every");
      char *cmdPart3 = NULL;
      if (cmdPart2) {
        *(cmdPart2++) = 0;
        cmdPart3 = strstr (cmdPart2, " set");
        if (cmdPart3)
          *(cmdPart3++) = 0;
      }
      // parse 1st part
      sharedMemory.gpio1 = sharedMemory.gpio2 = (gpio_num_t) 255; // invalid GPIO
      if (sscanf (cmdPart1, "start %7s sampling on GPIO %2i, %2i", sharedMemory.readType, &sharedMemory.gpio1, &sharedMemory.gpio2) < 2) {
        #ifdef __DMESG__
            dmesgQueue << "[oscilloscope] oscilloscope protocol syntax error.";
        #endif
        webSocket->sendString ("[oscilloscope] oscilloscope protocol syntax error."); // send error also to javascript client
        return;
      }
      // use adc1_get_raw instead of analogRead
      if (!strcmp (sharedMemory.readType, "analog")) {

          #if CONFIG_IDF_TARGET_ESP32
              __oscilloscope_h_debug__ ("MCU ESP32 pinout");

              // ESP32 board: https://docs.espressif.com/projects/esp-idf/en/v4.2/esp32/api-reference/peripherals/adc.html
              switch (sharedMemory.gpio1) {
                  // ADC1
                  case 36: sharedMemory.adcchannel1 = ADC1_CHANNEL_0; break;
                  case 37: sharedMemory.adcchannel1 = ADC1_CHANNEL_1; break;
                  case 38: sharedMemory.adcchannel1 = ADC1_CHANNEL_2; break;
                  case 39: sharedMemory.adcchannel1 = ADC1_CHANNEL_3; break;
                  case 32: sharedMemory.adcchannel1 = ADC1_CHANNEL_4; break;
                  case 33: sharedMemory.adcchannel1 = ADC1_CHANNEL_5; break;
                  case 34: sharedMemory.adcchannel1 = ADC1_CHANNEL_6; break;
                  case 35: sharedMemory.adcchannel1 = ADC1_CHANNEL_7; break;
                  // ADC2 (GPIOs 4, 0, 2, 15, 13, 12, 14, 27, 25, 26), the reading blocks when used together with WiFi?
                  // other GPIOs do not have ADC
                  default:  webSocket->sendString (cstring ("[oscilloscope] can't analogRead GPIO ") + cstring (sharedMemory.gpio1) + "."); // send error also to javascript client
                            return;  
              }
              switch (sharedMemory.gpio2) {
                  // ADC1
                  case 36: sharedMemory.adcchannel2 = ADC1_CHANNEL_0; break;
                  case 37: sharedMemory.adcchannel2 = ADC1_CHANNEL_1; break;
                  case 38: sharedMemory.adcchannel2 = ADC1_CHANNEL_2; break;
                  case 39: sharedMemory.adcchannel2 = ADC1_CHANNEL_3; break;
                  case 32: sharedMemory.adcchannel2 = ADC1_CHANNEL_4; break;
                  case 33: sharedMemory.adcchannel2 = ADC1_CHANNEL_5; break;
                  case 34: sharedMemory.adcchannel2 = ADC1_CHANNEL_6; break;
                  case 35: sharedMemory.adcchannel2 = ADC1_CHANNEL_7; break;
                  // not used
                  case 255: break;
                  // ADC2 (GPIOs 4, 0, 2, 15, 13, 12, 14, 27, 25, 26), the reading blocks when used together with WiFi?
                  // other GPIOs do not have ADC
                  default:  webSocket->sendString (cstring ("[oscilloscope] can't analogRead GPIO ") + cstring (sharedMemory.gpio2) + "."); // send error also to javascript client
                            return;  
              }


          // GPIO to CHANNEL mapping depending on the board type: https://github.com/espressif/arduino-esp32/blob/master/boards.txt
          #elif CONFIG_IDF_TARGET_ESP32S2
              __oscilloscope_h_debug__ ("MCU ESP32S2 pinout");
              // ESP32 S2 board: https://docs.espressif.com/projects/esp-idf/en/v4.4.1/esp32s2/api-reference/peripherals/adc.html
              switch (sharedMemory.gpio1) {
                  // ADC1
                  case  1: sharedMemory.adcchannel1 = ADC1_CHANNEL_0; break;
                  case  2: sharedMemory.adcchannel1 = ADC1_CHANNEL_1; break;
                  case  3: sharedMemory.adcchannel1 = ADC1_CHANNEL_2; break;
                  case  4: sharedMemory.adcchannel1 = ADC1_CHANNEL_3; break;
                  case  5: sharedMemory.adcchannel1 = ADC1_CHANNEL_4; break;
                  case  6: sharedMemory.adcchannel1 = ADC1_CHANNEL_5; break;
                  case  7: sharedMemory.adcchannel1 = ADC1_CHANNEL_6; break;
                  case  8: sharedMemory.adcchannel1 = ADC1_CHANNEL_7; break;
                  case  9: sharedMemory.adcchannel1 = ADC1_CHANNEL_8; break;
                  case 10: sharedMemory.adcchannel1 = ADC1_CHANNEL_9; break;
                  // ADC2 (GPIOs 11, 12, 13, 14, 15, 16, 17, 18, 19, 20), the reading blocks when used together with WiFi?
                  // other GPIOs do not have ADC
                  default:  webSocket->sendString (cstring ("[oscilloscope] can't analogRead GPIO ") + cstring (sharedMemory.gpio1) + "."); // send error also to javascript client
                            return;  
              }
              switch (sharedMemory.gpio2) {
                  // ADC1
                  case  1: sharedMemory.adcchannel2 = ADC1_CHANNEL_0; break;
                  case  2: sharedMemory.adcchannel2 = ADC1_CHANNEL_1; break;
                  case  3: sharedMemory.adcchannel2 = ADC1_CHANNEL_2; break;
                  case  4: sharedMemory.adcchannel2 = ADC1_CHANNEL_3; break;
                  case  5: sharedMemory.adcchannel2 = ADC1_CHANNEL_4; break;
                  case  6: sharedMemory.adcchannel2 = ADC1_CHANNEL_5; break;
                  case  7: sharedMemory.adcchannel2 = ADC1_CHANNEL_6; break;
                  case  8: sharedMemory.adcchannel2 = ADC1_CHANNEL_7; break;
                  case  9: sharedMemory.adcchannel2 = ADC1_CHANNEL_8; break;
                  case 10: sharedMemory.adcchannel2 = ADC1_CHANNEL_9; break;
                  // not used
                  case 255: break;
                  // ADC2 (GPIOs 11, 12, 13, 14, 15, 16, 17, 18, 19, 20), the reading blocks when used together with WiFi?
                  // other GPIOs do not have ADC
                  default:  webSocket->sendString (cstring ("[oscilloscope] can't analogRead GPIO ") + cstring (sharedMemory.gpio2) + "."); // send error also to javascript client
                            return;  
              }

          // #elif CONFIG_IDF_TARGET_ESP32C2

          #elif CONFIG_IDF_TARGET_ESP32S3
              __oscilloscope_h_debug__ ("MCU ESP32S3 pinout");

